// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// ___________________________1________________________________

let numbers = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i < numbers.length) {
    console.log(numbers[i]);
    i++
}

console.log('_________________________________________');
// ____________________________2________________________________
for (let mass of numbers) {
    console.log(mass);
}
console.log('_________________________________________');
// _________________________________3___________________________
j = 0;
while (j < numbers.length){
    if (j%2 !== 0){
        console.log(numbers[j]);
    }
    j++
}

console.log('_________________________________________');
// _______________________________4_____________________________________
for (let m = 0; m < numbers.length; m++) {
    if (m%2 !== 0) {
        console.log(numbers[m]);
    }
}

console.log('_________________________________________');
// ________________________________5____________________________________
u = 0;
while (u < numbers.length){
    if (u%2 === 0){
        console.log(numbers[u]);
    }
    u++
}

console.log('_________________________________________');
// __________________________________6____________________________________
for (let n = 0; n < numbers.length; n++){
    if (n%2 === 0){
        console.log(numbers[n]);
    }
}

console.log('_________________________________________');
// ___________________________________7_____________________________________
for (let k = 0; k < numbers.length; k++){
    if (numbers[k]%3 === 0) {
        numbers[k] = 'okten';
        console.log(numbers[k]);
    }
}

console.log('_________________________________________');
// ______________________________________8_____________________________________
let arr = [2,17,13,6,22,31,45,66,100,-18];
for (let g = arr.length; g>=0; g--){
    console.log(arr[g]);
}
console.log('_________________________________________');
